"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая вернет результат сложения цифр целого числа

ПРИМЕРЫ
--------------------------------------------------------------------------------
num_sum(5216) -> 14
num_sum(58716) -> 27
num_sum(321) -> 6
"""


def num_sum(numb: int) -> int:
    result = sum(map(int, str(numb)))   # str(numb) --> разбить введенное на цифры
# map(int, str(input())) --> каждую цифру привести к целому
# sum(map(int, str(numb))) --> посчитать сумму цифр
# result = (sum(map(int, str(numb))) --> вывести сумму
    # result = None
    return result


if __name__ == '__main__':
    assert num_sum(5216) == 14
    print('Решено!')
